Repository: MaxlandJV/MaxlandCineApp
Catalog: MaxlandCineApp/*.lproj/Localizable.strings
Languages: ca

# auth-required
source: Authentication required
ca: Autenticació requerida

# navigation-list-title
source: Movies and series
ca: Pel·lícules y sèries

# navigation-list-search
source: Search...
ca: Buscar...

# empty-title
source: They haven't created movies or series yet
ca: Encara no s'han creat pel·lícules ni sèries

# empty-add-movie-text
source: Add your first movie or series to be able to rate it and review it accordingly.
ca: Afegiu la vostra primera pel·lícula o sèrie per poder valorar-la i realitzar la crítica corresponent.

# empty-add-movie-button
source: Add first movie or series
ca: Afegir primera pel·lícula o sèrie

# movie-new
source: New movie or series
ca: Nova pel·lícula o sèrie

# movie-name
source: Name
ca: Nom

# movie-date
source: Viewing date
ca: Data de visionat

# movie-score
source: Score:
ca: Puntuació:

# movie-review
source: Review:
ca: Opinió:

# movie-type-1
source: It is a series
ca: És una sèrie

# movie-type-2
source: It is a movie
ca: És una pel·lícula

# movie-button-save
source: Save
ca: Guardar

# movie-button-cancel
source: Cancel
ca: Cancel·lar

# movie-button-update
source: Update
ca: Actualitzar

# movie-error-01
source: The name of the film is a mandatory information.
ca: El nom de la pel·lícula és una dada obligatòria.

# setup-title
source: Settings
ca: Configuració

# setup-about
source: About Maxland Cine
ca: Sobre Maxland Cine

# setup-details
source: This application is designed to be able to store a movie and TV show diary, indicating its title, its viewing date, a score and a descriptive text or film review. The application uses MVVM architecture and CoreData.
ca: Aquesta aplicació està concebuda per poder emmagatzemar un diari de pel·lícules i sèries de televisió, indicant-ne el títol, la data de visualització, una puntuació i un text descriptiu o crítica cinematrogràfica. L'aplicació utilitza arquitectura MVVM i CoreData.

# setup-code
source: APP source code
ca: Codi font de l'APP

# setup-about-me
source: About me...
ca: Sobre mi...

# setup-auth
source: Require authentication
ca: Requerir autenticació

# setup-bioauth
source: Biometric authentication
ca: Autenticació biomètrica

# setup-auth-details
source: When enabled, Face ID or Touch ID is required to access content.
ca: Quan està habilitat, cal utilitzar Face ID o Touch ID per accedir al contingut.

# setup-links
source: Links
ca: Enllaços

# setup-copias-seguridad
source: Backups
ca: Còpies de seguretat

# setup-exportar-datos
source: Export data
ca: Exportar dades

# setup-importar-datos
source: Import data
ca: Importar dades

# stats-title
source: Statistics
ca: Estadístiques

# stats-movie-number
source: Number of movies
ca: Nombre de pel·lícules

# stats-serie-number
source: Number of series
ca: Nombre de sèries

# stats-total-number
source: Number of movies and series
ca: Nombre de pel·lícules i sèries

# stats-score
source: By score
ca: Per puntuació

# stats-todo
source: All
ca: Tot

# stats-movies
source: Movies
ca: Pel·lícules

# stats-series
source: Series
ca: Sèries

# movie-export-data
source: Export
ca: Exportar

# movie-export-detail
source: Using this option you can export all the data contained in the application to a text file in JSON format. This file can be re-imported using the import option located in the backup section.
ca: Mitjançant aquesta opció es poden exportar totes les dades contingudes a l'aplicació a un fitxer de text en format JSON. Aquest fitxer es pot tornar a importar mitjançant l'opció d'importació ubicada a l'apartat de còpies de seguretat.

# movie-export-alert
source: File successfully exported.
ca: Fitxer correctament exportat.

# movie-import-data
source: Import
ca: Importar

# movie-import-detail1
source: Using this option, a text file in JSON format containing the data from a backup can be imported into the application.
ca: Mitjançant aquesta opció podeu importar a l'aplicació un fitxer de text en format JSON que contingui les dades d'una còpia de seguretat.

# movie-import-detail2
source: Be especially careful as importing will lose all data stored in the application.
ca: Tingueu especial atenció ja que en importar es perdran totes les dades emmagatzemades a l'aplicació.

# movie-import-alert
source: File successfully imported.
ca: Fitxer correctament importat.
